test/invoice_payment_succeeded.json

{
  "type": "invoice.payment_succeeded",
  "livemode": false,
  "pending_webhooks": 0,
  "created": 1352910508,
  "object": "event",
  "id": "evt_0jcGFxHNsrDTj4",
  "data": {
    "object": {
      "starting_balance": 0,
      "ending_balance": 0,
      "paid": true,
      "attempted": true,
      "total": 6999,
      "lines": {
        "object": "list",
        "count": 1,
        "data": [
          {
            "type": "subscription",
            "plan": {
              "livemode": false,
              "object": "plan",
              "interval_count": 1,
              "amount": 6999,
              "name": "BandFrame PRO Annual",
              "currency": "usd",
              "id": "yearly",
              "interval": "year",
              "trial_period_days": null
            },
            "livemode": false,
            "object": "line_item",
            "description": null,
            "amount": 6999,
            "currency": "usd",
            "period": {
              "end": 1384446507,
              "start": 1352910507
            },
            "id": "su_0jcGpDYAkeNj0a",
            "proration": false,
            "quantity": 1
          }
        ],
        "url": "/v1/invoices/in_0jcG7zz2RtscPB/lines"
      },
      "subtotal": 6999,
      "livemode": false,
      "period_start": 1352910503,
      "charge": "ch_0jcGRmThyuRYyh",
      "object": "invoice",
      "customer": "cus_0jcFnB3UIIiicv",
      "period_end": 1352910507,
      "discount": null,
      "next_payment_attempt": null,
      "currency": "usd",
      "date": 1352910507,
      "closed": true,
      "id": "in_0jcG7zz2RtscPB",
      "attempt_count": 0,
      "amount_due": 6999
    }
  }
}